tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf6628_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF6628_H_
#define _PIC18LF6628_H_

#define SSP2CON2                      0
#define SEN2                          1
#define SSP2CON2_SEN                  2
#define ADMSK12                       3
#define SSP2CON2_RSEN                 4
#define RSEN2                         5
#define ADMSK22                       6
#define PEN2                          7
#define SSP2CON2_PEN                  8
#define ADMSK32                       9
#define SSP2CON2_RCEN                 10
#define RCEN2                         11
#define ACKEN2                        12
#define ADMSK42                       13
#define SSP2CON2_ACKEN                14
#define ACKDT2                        15
#define ADMSK52                       16
#define SSP2CON2_ACKDT                17
#define SSP2CON2_ACKSTAT              18
#define ACKSTAT2                      19
#define GCEN2                         20
#define SSP2CON2_GCEN                 21
#define SSP2CON1                      22
#define SSP2CON1_SSPM                 23
#define SSP2CON1_SSPM0                24
#define SSPM02                        25
#define SSPM12                        26
#define SSP2CON1_SSPM1                27
#define SSP2CON1_SSPM2                28
#define SSPM22                        29
#define SSPM32                        30
#define SSP2CON1_SSPM3                31
#define SSP2CON1_CKP                  32
#define CKP2                          33
#define SSPEN2                        34
#define SSP2CON1_SSPEN                35
#define SSPOV2                        36
#define SSP2CON1_SSPOV                37
#define WCOL2                         38
#define SSP2CON1_WCOL                 39
#define SSP2STAT                      40
#define SSP2STAT_BF                   41
#define BF2                           42
#define SSP2STAT_UA                   43
#define UA2                           44
#define SSP2STAT_R_W                  45
#define RW2                           46
#define SSP2STAT_R                    47
#define SSP2STAT_nWRITE               48
#define SSP2STAT_nW                   49
#define READ_WRITE2                   50
#define nW2                           51
#define SSP2STAT_I2C_READ             52
#define I2C_READ2                     53
#define SSP2STAT_R_NOT_W              54
#define R_nW2                         55
#define SSP2STAT_READ_WRITE           56
#define nWRITE2                       57
#define R_W2                          58
#define SSP2STAT_R_nW                 59
#define SSP2STAT_NOT_WRITE            60
#define SSP2STAT_S                    61
#define S2                            62
#define START2                        63
#define SSP2STAT_I2C_START            64
#define I2C_START2                    65
#define STOP2                         66
#define SSP2STAT_I2C_STOP             67
#define SSP2STAT_P                    68
#define P2                            69
#define I2C_STOP2                     70
#define I2C_DAT2                      71
#define SSP2STAT_D                    72
#define DATA_ADDRESS2                 73
#define SSP2STAT_D_NOT_A              74
#define SSP2STAT_I2C_DAT              75
#define D_A2                          76
#define SSP2STAT_NOT_ADDRESS          77
#define SSP2STAT_D_nA                 78
#define SSP2STAT_DATA_ADDRESS         79
#define SSP2STAT_nADDRESS             80
#define nA2                           81
#define DA2                           82
#define nADDRESS2                     83
#define SSP2STAT_nA                   84
#define SSP2STAT_D_A                  85
#define D_nA2                         86
#define SSP2STAT_CKE                  87
#define CKE2                          88
#define SSP2STAT_SMP                  89
#define SMP2                          90
#define SSP2ADD                       91
#define MSK02                         92
#define MSK12                         93
#define MSK22                         94
#define MSK32                         95
#define MSK42                         96
#define MSK52                         97
#define MSK62                         98
#define MSK72                         99
#define ECCP2DEL                      100
#define P2DC0                         101
#define P2DC                          102
#define ECCP2DEL_PDC0                 103
#define P2DC1                         104
#define ECCP2DEL_PDC1                 105
#define P2DC2                         106
#define ECCP2DEL_PDC2                 107
#define P2DC3                         108
#define ECCP2DEL_PDC3                 109
#define P2DC4                         110
#define ECCP2DEL_PDC4                 111
#define P2DC5                         112
#define ECCP2DEL_PDC5                 113
#define P2DC6                         114
#define ECCP2DEL_PDC6                 115
#define ECCP2DEL_PRSEN                116
#define P2RSEN                        117
#define ECCP2AS_PSSBD0                118
#define PSS2BD                        119
#define PSS2BD0                       120
#define ECCP2AS_PSSBD1                121
#define PSS2BD1                       122
#define PSS2AC0                       123
#define ECCP2AS_PSSAC0                124
#define PSS2AC                        125
#define ECCP2AS_PSSAC1                126
#define PSS2AC1                       127
#define ECCP2AS                       128
#define ECCP2AS0                      129
#define ECCP2AS_ECCPAS0               130
#define ECCP2AS1                      131
#define ECCP2AS_ECCPAS1               132
#define ECCP2AS2                      133
#define ECCP2AS_ECCPAS2               134
#define ECCPASE                       135
#define ECCP2ASE                      136
#define ECCP3DEL                      137
#define ECCP3DEL_PDC0                 138
#define P3DC0                         139
#define P3DC                          140
#define ECCP3DEL_PDC1                 141
#define P3DC1                         142
#define ECCP3DEL_PDC2                 143
#define P3DC2                         144
#define ECCP3DEL_PDC3                 145
#define P3DC3                         146
#define ECCP3DEL_PDC4                 147
#define P3DC4                         148
#define ECCP3DEL_PDC5                 149
#define P3DC5                         150
#define ECCP3DEL_PDC6                 151
#define P3DC6                         152
#define P3RSEN                        153
#define ECCP3DEL_PRSEN                154
#define ECCP3AS_PSSBD0                155
#define PSS3BD                        156
#define PSS3BD0                       157
#define ECCP3AS_PSSBD1                158
#define PSS3BD1                       159
#define PSS3AC                        160
#define ECCP3AS_PSSAC0                161
#define PSS3AC0                       162
#define ECCP3AS_PSSAC1                163
#define PSS3AC1                       164
#define ECCP3AS_ECCPAS0               165
#define ECCP3AS0                      166
#define ECCP3AS                       167
#define ECCP3AS_ECCPAS1               168
#define ECCP3AS1                      169
#define ECCP3AS2                      170
#define ECCP3AS_ECCPAS2               171
#define ECCP3AS_ECCPASE               172
#define ECCP3ASE                      173
#define RCSTA2                        174
#define RCD82                         175
#define RX9D2                         176
#define RCSTA2_RCD8                   177
#define RCSTA2_RX9D                   178
#define RCSTA2_OERR                   179
#define OERR2                         180
#define FERR2                         181
#define RCSTA2_FERR                   182
#define ADDEN2                        183
#define RCSTA2_ADDEN                  184
#define RCSTA2_CREN                   185
#define CREN2                         186
#define SREN2                         187
#define RCSTA2_SREN                   188
#define RC92                          189
#define RCSTA2_nRC8                   190
#define RC8_92                        191
#define RCSTA2_RX9                    192
#define RCSTA2_NOT_RC8                193
#define RCSTA2_RC9                    194
#define RCSTA2_RC8_9                  195
#define RX92                          196
#define RCSTA2_SPEN                   197
#define SPEN2                         198
#define TXSTA2                        199
#define TXSTA2_TXD8                   200
#define TX9D2                         201
#define TXSTA2_TX9D                   202
#define TXD82                         203
#define TRMT2                         204
#define TXSTA2_TRMT                   205
#define BRGH2                         206
#define TXSTA2_BRGH                   207
#define SENDB2                        208
#define TXSTA2_SENDB                  209
#define TXSTA2_SYNC                   210
#define SYNC2                         211
#define TXEN2                         212
#define TXSTA2_TXEN                   213
#define TX8_92                        214
#define TX92                          215
#define TXSTA2_TX9                    216
#define TXSTA2_nTX8                   217
#define TXSTA2_NOT_TX8                218
#define TXSTA2_TX8_9                  219
#define TXSTA2_CSRC                   220
#define CSRC2                         221
#define CCP5CON                       222
#define CCP5M0                        223
#define CCP5M                         224
#define CCP5M1                        225
#define CCP5M2                        226
#define CCP5M3                        227
#define DCCP5Y                        228
#define DC5B0                         229
#define DC5B                          230
#define DC5B1                         231
#define DCCP5X                        232
#define CCP4CON                       233
#define CCP4M                         234
#define CCP4M0                        235
#define CCP4M1                        236
#define CCP4M2                        237
#define CCP4M3                        238
#define DCCP4Y                        239
#define DC4B0                         240
#define DC4B                          241
#define DCCP4X                        242
#define DC4B1                         243
#define T4CON                         244
#define T4CKPS0                       245
#define T4CKPS                        246
#define T4CKPS1                       247
#define TMR4ON                        248
#define T4OUTPS0                      249
#define T4CON_TOUTPS                  250
#define T4OUTPS1                      251
#define T4OUTPS2                      252
#define T4OUTPS3                      253
#define ECCP1DEL                      254
#define P1DC0                         255
#define ECCP1DEL_PDC0                 256
#define P1DC                          257
#define P1DC1                         258
#define ECCP1DEL_PDC1                 259
#define P1DC2                         260
#define ECCP1DEL_PDC2                 261
#define P1DC3                         262
#define ECCP1DEL_PDC3                 263
#define P1DC4                         264
#define ECCP1DEL_PDC4                 265
#define P1DC5                         266
#define ECCP1DEL_PDC5                 267
#define P1DC6                         268
#define ECCP1DEL_PDC6                 269
#define P1RSEN                        270
#define ECCP1DEL_PRSEN                271
#define BAUDCON2                      272
#define ABDEN2                        273
#define BAUDCON2_ABDEN                274
#define WUE2                          275
#define BAUDCON2_WUE                  276
#define BAUDCON2_BRG16                277
#define BRG162                        278
#define SCKP2                         279
#define BAUDCON2_SCKP                 280
#define TXCKP2                        281
#define BAUDCON2_RCMT                 282
#define BAUDCON2_RCIDL                283
#define RCMT2                         284
#define RCIDL2                        285
#define BAUDCON2_ABDOVF               286
#define ABDOVF2                       287
#define BAUDCON1                      288
#define BAUDCON1_ABDEN                289
#define ABDEN1                        290
#define BAUDCON1_WUE                  291
#define WUE1                          292
#define W4E                           293
#define BRG161                        294
#define BAUDCON1_BRG16                295
#define SCKP1                         296
#define CKTXP                         297
#define TXCKP                         298
#define BAUDCON1_SCKP                 299
#define TXCKP1                        300
#define BAUDCON1_RCMT                 301
#define RCMT1                         302
#define RCIDL1                        303
#define BAUDCON1_RCIDL                304
#define ABDOVF1                       305
#define BAUDCON1_ABDOVF               306
#define PORTA                         307
#define ULPWUIN                       308
#define AN0                           309
#define PORTA_RA0                     310
#define PORTA_RA1                     311
#define AN1                           312
#define AN2                           313
#define PORTA_RA2                     314
#define VREFM                         315
#define AN3                           316
#define PORTA_RA3                     317
#define VREFP                         318
#define PORTA_RA4                     319
#define T0CKI                         320
#define AN4                           321
#define PORTA_RA5                     322
#define LVDIN                         323
#define HLVDIN                        324
#define PORTA_RA6                     325
#define PORTA_RA7                     326
#define PORTA_RJPU                    327
#define PORTB                         328
#define FLT0                          329
#define INT0                          330
#define PORTB_RB0                     331
#define INT1                          332
#define PORTB_RB1                     333
#define INT2                          334
#define PORTB_RB2                     335
#define INT3                          336
#define CCP2_PA2                      337
#define PORTB_RB3                     338
#define KBI0                          339
#define PORTB_RB4                     340
#define KBI1                          341
#define PORTB_RB5                     342
#define KBI2                          343
#define PORTB_RB6                     344
#define KBI3                          345
#define PORTB_RB7                     346
#define PORTC                         347
#define T13CKI                        348
#define T1OSO                         349
#define PORTC_RC0                     350
#define PORTC_CCP2                    351
#define PORTC_ECCP2                   352
#define T1OSI                         353
#define PA2                           354
#define PORTC_RC1                     355
#define PORTC_P2A                     356
#define CCP1                          357
#define P1A                           358
#define ECCP1                         359
#define PA1                           360
#define PORTC_RC2                     361
#define SCK1                          362
#define SCL                           363
#define SCL1                          364
#define SCK                           365
#define PORTC_RC3                     366
#define PORTC_RC4                     367
#define SDI1                          368
#define SDA1                          369
#define SDA                           370
#define SDI                           371
#define SDO1                          372
#define SDO                           373
#define PORTC_RC5                     374
#define TX                            375
#define PORTC_RC6                     376
#define CK                            377
#define TX1                           378
#define CK1                           379
#define DT                            380
#define RX                            381
#define RX1                           382
#define DT1                           383
#define PORTC_RC7                     384
#define PORTD                         385
#define PSP0                          386
#define PORTD_RD0                     387
#define PSP1                          388
#define PORTD_RD1                     389
#define PSP2                          390
#define PORTD_RD2                     391
#define PSP3                          392
#define PORTD_RD3                     393
#define PSP4                          394
#define SDO2                          395
#define PORTD_RD4                     396
#define PSP5                          397
#define SDI2                          398
#define SDA2                          399
#define PORTD_RD5                     400
#define SCK2                          401
#define PSP6                          402
#define SCL2                          403
#define PORTD_RD6                     404
#define SS2                           405
#define PSP7                          406
#define NOT_SS2                       407
#define nSS2                          408
#define PORTD_RD7                     409
#define PORTE                         410
#define P2D                           411
#define PORTE_RD                      412
#define NOT_RD                        413
#define nRD                           414
#define PD2                           415
#define RDE                           416
#define PORTE_RE0                     417
#define P2C                           418
#define PORTE_WR                      419
#define NOT_WR                        420
#define nWR                           421
#define PORTE_RE1                     422
#define WRE                           423
#define PC2                           424
#define P2B                           425
#define nCS                           426
#define NOT_CS                        427
#define CS                            428
#define CCP10                         429
#define PB2                           430
#define PORTE_RE2                     431
#define CCP9E                         432
#define P3C                           433
#define PORTE_RE3                     434
#define PC3E                          435
#define PB3E                          436
#define P3B                           437
#define PORTE_RE4                     438
#define CCP8E                         439
#define P1C                           440
#define CCP7E                         441
#define PORTE_RE5                     442
#define PC1E                          443
#define CCP6E                         444
#define P1B                           445
#define PORTE_RE6                     446
#define PB1E                          447
#define CCP2E                         448
#define PORTE_ECCP2                   449
#define PORTE_P2A                     450
#define PA2E                          451
#define PORTE_CCP2                    452
#define PORTE_RE7                     453
#define PORTF                         454
#define PORTF_RF0                     455
#define AN5                           456
#define PORTF_RF1                     457
#define C2OUTF                        458
#define AN6                           459
#define PORTF_C2OUT                   460
#define PORTF_RF2                     461
#define AN7                           462
#define C1OUTF                        463
#define PORTF_C1OUT                   464
#define PORTF_RF3                     465
#define AN8                           466
#define PORTF_RF4                     467
#define AN9                           468
#define PORTF_RF5                     469
#define CVREF                         470
#define AN10                          471
#define PORTF_RF6                     472
#define AN11                          473
#define PORTF_RF7                     474
#define SS1                           475
#define nSS1                          476
#define NOT_SS1                       477
#define PORTG                         478
#define CCP3                          479
#define P3A                           480
#define ECCP3                         481
#define PORTG_RG0                     482
#define C3OUTG                        483
#define TX2                           484
#define PORTG_RG1                     485
#define CK2                           486
#define RX2                           487
#define PORTG_RG2                     488
#define DT2                           489
#define CCP4                          490
#define PORTG_RG3                     491
#define P3D                           492
#define CCP5                          493
#define PORTG_RG4                     494
#define P1D                           495
#define PORTG_RJPU                    496
#define RG5                           497
#define NOT_MCLR                      498
#define MCLR                          499
#define nMCLR                         500
#define LATA                          501
#define LATA0                         502
#define LA0                           503
#define LATA1                         504
#define LA1                           505
#define LATA2                         506
#define LA2                           507
#define LATA3                         508
#define LA3                           509
#define LATA4                         510
#define LA4                           511
#define LATA5                         512
#define LA5                           513
#define LATA6                         514
#define LA6                           515
#define LATA7                         516
#define LA7                           517
#define LATB                          518
#define LB0                           519
#define LATB0                         520
#define LB1                           521
